# Pandas
- is a python library provides high performance DS and Data analysis tools. 
- It runs on top of Numpy. 
- is a data analysis library that provide the concept called Data Frame.

In [8]:
import pandas as pd

In [9]:
import numpy as np

## Data Frame
- A DataFrame is a two-dimensional, labeled data structure with columns that can be of different types. 
- It is similar to a spreadsheet or SQL table and is particularly useful for working with structured data.

#### Creating a Data Frame

In [10]:
df=pd.DataFrame(np.arange(0,12).reshape(3,4),index=("Row1","Row2","Row3"),columns=("Column1","Column2","Column3","Column4"))

In [11]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11

#### Accessing Elements of DataFrame

In [12]:
# Accessing a column by name

In [13]:
df["Column1"]

Row1    0
Row2    4
Row3    8
Name: Column1, dtype: int32

In [14]:
df["Column1"][1]

4

In [15]:
df[["Column1","Column3"]]

      Column1  Column3
Row1        0        2
Row2        4        6
Row3        8       10

In [16]:
# Accessing a Row by loc

In [17]:
df.loc['Row3']

Column1     8
Column2     9
Column3    10
Column4    11
Name: Row3, dtype: int32

In [18]:
type(df.loc['Row3'])

pandas.core.series.Series

In [19]:
df.iloc[0:3,1:3]

      Column2  Column3
Row1        1        2
Row2        5        6
Row3        9       10

In [20]:
type(df.iloc[0:3,0:2])

pandas.core.frame.DataFrame

#### Converting DataFrame to a CSV file
- CSV (Comma-Separated Values) files important in data analysis and manipulation.

In [21]:
df.to_csv('test1_from_2_Pandas.csv')

You will get a csv file whose content is shown below

This can be opened in excel also.

#### Converting CSV to DataFrame
You can create a DataFrame from various sources, such as lists, dictionaries, CSV files, Excel files, and databases. 

The following csv file is created in notepad

In [22]:
df1=pd.read_csv('test2_to_2_Pandas.csv')
df1.head()

  Unnamed: 0  Column1  Column2  Column3  Column4
0       Row1        0        1        2        3
1       Row2        4        5        6        7
2       Row3        8        9       10       11
3       Row4       13       15       16       18

##### head() method 
- is used to display the first few rows of a DataFrame. 
- By default, it shows the first 5 rows, but you can specify the number of rows you want to display by passing an argument to the head() method.

##### making any column as index column

In [30]:
df1=pd.read_csv('test2_to_2_Pandas.csv',index_col=0)
df1.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       13       15       16       18

In [23]:
df2=pd.read_csv('test3_Kaggle_to_2_Pandas.csv')
df2.head(8)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,0,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,1,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,0,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S

#### Reading only a few columns

In [24]:
df2=pd.read_csv('test3_Kaggle_to_2_Pandas.csv',usecols =["Survived", "Pclass","Name","Sex"])
df2.head()

   Survived  Pclass                                          Name     Sex
0         0       3                              Kelly, Mr. James    male
1         1       3              Wilkes, Mrs. James (Ellen Needs)  female
2         0       2                     Myles, Mr. Thomas Francis    male
3         0       3                              Wirz, Mr. Albert    male
4         1       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

#### Some common Operation on datasets

In [33]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  418 non-null    int64
 1   Pclass    418 non-null    int64
 2   Name      418 non-null    object
 3   Sex       418 non-null    object
dtypes: int64(2), object(2)
memory usage: 13.2+ KB

In [34]:
df2.describe()

         Survived      Pclass
count  418.000000  418.000000
mean     0.363636    2.265550
std      0.481622    0.841838
min      0.000000    1.000000
25%      0.000000    1.000000
50%      0.000000    3.000000
75%      1.000000    3.000000
max      1.000000    3.000000

In [38]:
df2.head()

   Survived  Pclass                                          Name     Sex
0         0       3                              Kelly, Mr. James    male
1         1       3              Wilkes, Mrs. James (Ellen Needs)  female
2         0       2                     Myles, Mr. Thomas Francis    male
3         0       3                              Wirz, Mr. Albert    male
4         1       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

In [37]:
# Get the unique category count
df2['Pclass'].value_counts()

3    218
1    107
2     93
Name: Pclass, dtype: int64

In [41]:
df2[df2['Survived']>0]

     Survived  Pclass                                             Name     Sex
1           1       3                 Wilkes, Mrs. James (Ellen Needs)  female
4           1       3     Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female
6           1       3                             Connolly, Miss. Kate  female
8           1       3        Abrahim, Mrs. Joseph (Sophie Halaut Easu)  female
12          1       1    Snyder, Mrs. John Pillsbury (Nelle Stevenson)  female
..        ...     ...                                              ...     ...
409         1       3                        Peacock, Miss. Treasteall  female
410         1       3                           Naughton, Miss. Hannah  female
411         1       1  Minahan, Mrs. William Edward (Lillian E Thorpe)  female
412         1       3                   Henriksson, Miss. Jenny Lovisa  female
414         1       1                     Oliva y Ocana, Dona. Fermina  female

[152 rows x 4 columns]

In [48]:
## URL to CSV

df=pd.read_csv('https://www.kaggle.com/datasets/rafsunahmad/plane-price-prediction',sep='\t')
df.head()

                                     <!DOCTYPE html>
0                                   <html lang="en">
1                                             <head>
2    <title>Airplane Price Prediction | Kaggle</t...
3                           <meta charset="utf-8" />
4      <meta name="robots" content="index, follow...

## Data Series

- Series is a one-dimensional labeled array capable of holding any data type. 
- It is similar to a column in a spreadsheet or a single variable in statistics. 
- A Series can be created from various data structures, such as lists, arrays, or dictionaries.

In [25]:
data = [2,3,6,1,9,5,6]
series=pd.Series(data)
print(series)

0    2
1    3
2    6
3    1
4    9
5    5
6    6
dtype: int64

In [26]:
type(series)

pandas.core.series.Series